"""
Дани двійкові файли f та g, компоненти яких є цілими числами. Отримати в файлі h нові компоненти, що утворюються в
результаті віднімання двох компонентів файлів f та g, що знаходяться на відповідних позиціях
Barbak Vladuslav 122V
"""
from random import randint  # Імпортуємо рандом для генерації файлу з числами
while True:  # Цикл для подальшої перевірки користувача на перезапуск програми
    f=open('f.txt', 'wb')  # Відкриваємо файл для подальшого введення файлу в режимі wb-запис данних у двійковому форматі
    f.write(bytearray([randint(0,255) for i in range(int(input("Скільки чисел ви хочите ввести ? ")))]))  # Задаемо довжину файла та через рандом задаютья значення в файл
    f=open('f.txt', 'rb')  # Відкривається файл в режимі читання у двійковому форматі 
    x=f.read()  # Значенню x присвоюємо данні з файлу для подальшої їхньої обробки
    f.close()  # Закриваємо файл f
# Виконуємо аналогічні операції що виконували раніше тільки приміняємо їх до файлу g
    g=open('g.txt', 'wb')
    g.write(bytearray([randint(0,255) for j in range(int(input("Скільки чисел ви хочите ввести ? ")))]))
    g=open('g.txt', 'rb')
    y=g.read()
    g.close()
# Створюємо два списки для збередення данних із файлу 
    s1=[]
    s2=[]

    for i in x:  # Перебираємо кожний елемент із файлу f
        s1.append(i)  # Додаємо значення i в список
    for j in y:  # Перебираємо кожний елемент із файлу g
        s2.append(j)  # Додаємо значення j в список
# Виводимо два списки для наглядності
    print('1-Список:', s1)
    print('2-Список:', s2)

    difference=[a-b for a, b in zip(s1,s2)]  # Знаходимо різницю відповідних елементів, попередньо викоритавши функцію zip для одночасної ітерації двох списків 
    print('Різниця:', difference)  # Виводимо різницю двох списків

    h=open('h.txt', 'w')  # Відкриваємо файл h для запису данних
    h.write(' '.join(map(str,difference)))  # Записуємо в файл різницю попередніх списків розділивши їх пробілами
    h.close()  # Закриваємо файл

    result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
    if result == '1':
        continue
    else:
        break
